Revit 2027 API
BalusterPlacement.BalusterPerTreadNumber Property
 The number of balusters per tread.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int BalusterPerTreadNumber { get; set; }
Public Property BalusterPerTreadNumber As Integer
	Get
	Set
public:
property int BalusterPerTreadNumber {
	int get ();
	void set (int value);
}
member BalusterPerTreadNumber : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for balusterPerTreadNumber is not positive.
Remarks
 Applicable only if UseBalusterPerTreadOnStairs is true.
See Also
Reference
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace